<<<<<<< HEAD
point = int(input('Введите количество баллов(от 0 до 100): '))
if 90 <= point <= 100:
    print('Ваша оценка: Отлично')
elif 70 <= point < 90:
    print('Ваша оценка: Хорошо')
elif 50 <= point < 70:
    print('Ваша оценка: Удовлетворительно')
elif 0 <= point < 50:
    print('Ваша оценка: Неудовлетворительно')

else:
=======
point = int(input('Введите количество баллов(от 0 до 100): '))
if 90 <= point <= 100:
    print('Ваша оценка: Отлично')
elif 70 <= point < 90:
    print('Ваша оценка: Хорошо')
elif 50 <= point < 70:
    print('Ваша оценка: Удовлетворительно')
elif 0 <= point < 50:
    print('Ваша оценка: Неудовлетворительно')

else:
>>>>>>> d6adf397ce76f5063ab9da53365e45c33c9cf186
    print('Ошибка: введите число от 0 до 100')