<<<<<<< HEAD
#Напишите лямбда-функцию, которая фильтрует чётные числа из списка

numbers = [1, 2, 3, 4, 5]
ever_numbers = list(filter(lambda x:x % 2 == 0,numbers))

=======
#Напишите лямбда-функцию, которая фильтрует чётные числа из списка

numbers = [1, 2, 3, 4, 5]
ever_numbers = list(filter(lambda x:x % 2 == 0,numbers))

>>>>>>> d6adf397ce76f5063ab9da53365e45c33c9cf186
print(ever_numbers)