<<<<<<< HEAD
#Напишите программу, которая:
#Создает словарь с данными студента (имя, возраст, курс).
#Запрашивает у пользователя новый курс.
#Обновляет значение в словаре.
#Выводит обновленный словарь.

data_student = {'name': 'Анна', 'age': 20, 'course': 2}

new_course = int(input('Введите новый курс: '))
data_student['course'] = new_course

=======
#Напишите программу, которая:
#Создает словарь с данными студента (имя, возраст, курс).
#Запрашивает у пользователя новый курс.
#Обновляет значение в словаре.
#Выводит обновленный словарь.

data_student = {'name': 'Анна', 'age': 20, 'course': 2}

new_course = int(input('Введите новый курс: '))
data_student['course'] = new_course

>>>>>>> d6adf397ce76f5063ab9da53365e45c33c9cf186
print(data_student)