<<<<<<< HEAD
#Напишите код, который выводит:
#Общих друзей.
#Всех уникальных друзей.


friends1 = {"Анна", "Борис", "Владимир"}  
friends2 = {"Борис", "Дмитрий", "Анна"}  
all_friends = friends1.union(friends2)

print(f'Общие друзья: {friends1 & friends2}')
=======
#Напишите код, который выводит:
#Общих друзей.
#Всех уникальных друзей.


friends1 = {"Анна", "Борис", "Владимир"}  
friends2 = {"Борис", "Дмитрий", "Анна"}  
all_friends = friends1.union(friends2)

print(f'Общие друзья: {friends1 & friends2}')
>>>>>>> d6adf397ce76f5063ab9da53365e45c33c9cf186
print(f'Все друзья: {all_friends}')